In [1]:
import numpy as np
import pandas as pd

### 1. Write a program to create a pandas series from range X to Y.

In [2]:
x = 10 
y = 20

In [3]:
pd.Series(np.arange(x,y+1),name='Series')

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
Name: Series, dtype: int32

### 2. Write a Python program to add, subtract, multiple and divide two Pandas Series.

In [4]:
series_a = pd.Series([1, 2, 3, 4, 5])
series_b = pd.Series([6, 7, 8, 9, 10])

> ### Add

In [5]:
series_a + series_b

0     7
1     9
2    11
3    13
4    15
dtype: int64

> ### Subtract

In [6]:
series_a - series_b

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

> ### Multiply

In [8]:
series_a * series_b

0     6
1    14
2    24
3    36
4    50
dtype: int64

> ### Divide

In [10]:
series_a / series_b

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

### 3. From the raw data below create a Pandas Series

In [11]:
names = [ ' Aron', 'Jackson ', ' Ahree ', 'Sam']

In [12]:
series = pd.Series(names, name='names')
series

0        Aron
1    Jackson
2      Ahree
3         Sam
Name: names, dtype: object

> ### Print all elements after stripping spaces from the left and right

In [14]:
series.str.strip()

0       Aron
1    Jackson
2      Ahree
3        Sam
Name: names, dtype: object

> ### Print all the elements after removing spaces from the left only

In [15]:
series.str.lstrip()

0        Aron
1    Jackson
2      Ahree
3         Sam
Name: names, dtype: object

> ### Print all the elements after removing spaces from the right only

In [16]:
series.str.rstrip()

0       Aron
1    Jackson
2      Ahree
3        Sam
Name: names, dtype: object

### 4. Write a program to convert a dictionary into Pandas Series.

In [17]:
dictionary = {'Sam':89,'Aron':82,'Gray':78,'Isla':93,'Ahree':87}
series = pd.Series(dictionary)
series

Sam      89
Aron     82
Gray     78
Isla     93
Ahree    87
dtype: int64

### 5. Write a program to convert the below dictionary into DataFrame and print head(2) and tail(2) of the DataFrame.

In [20]:
df = pd.DataFrame({'Name':['Sameer','Leona','Samuel','Jackson','Gray','Sylphia'],
'Class':[11,11,12,12,11,12],
'Age':[17,18,19,17,21,23]
})
df

      Name  Class  Age
0   Sameer     11   17
1    Leona     11   18
2   Samuel     12   19
3  Jackson     12   17
4     Gray     11   21
5  Sylphia     12   23

> ### head(2)

In [21]:
df.head(2)

     Name  Class  Age
0  Sameer     11   17
1   Leona     11   18

> ### tail(2)

In [22]:
df.tail(2)

      Name  Class  Age
4     Gray     11   21
5  Sylphia     12   23

### 6. Convert the given nested list into single series and print the output in sorted form.

In [48]:
data = [[1,23,12,31,14,12],[32,43,32,42],[65,75,65,57,41,33,68,52]]
series = pd.Series(data)

In [49]:
series.apply(pd.Series)

      0     1     2     3     4     5     6     7
0   1.0  23.0  12.0  31.0  14.0  12.0   NaN   NaN
1  32.0  43.0  32.0  42.0   NaN   NaN   NaN   NaN
2  65.0  75.0  65.0  57.0  41.0  33.0  68.0  52.0

In [47]:
series = series.apply(pd.Series).stack().reset_index(drop=True).sort_values(axis=0)
series

0      1.0
2     12.0
5     12.0
4     14.0
1     23.0
3     31.0
8     32.0
6     32.0
15    33.0
14    41.0
9     42.0
7     43.0
17    52.0
13    57.0
10    65.0
12    65.0
16    68.0
11    75.0
dtype: float64

### 7. Create a series from 1 to 1000 and select only numbers divisble by 7 and 17.

In [50]:
series = pd.Series(np.arange(1,1001))
series.head()

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [53]:
series[series%119==0]

118    119
237    238
356    357
475    476
594    595
713    714
832    833
951    952
dtype: int32

### 8. Create a program that reads the below dictionary as a DataFrame and iterate over columns and rows.

In [54]:
my_dict={'Name':['Sameer','Leona','Samuel','Jackson','Gray','Sylphia'],
 'Class':[11,11,12,12,11,12], 'Age':[17,17,18,17,21,23] }
df = pd.DataFrame(my_dict)
df

      Name  Class  Age
0   Sameer     11   17
1    Leona     11   17
2   Samuel     12   18
3  Jackson     12   17
4     Gray     11   21
5  Sylphia     12   23

In [72]:
for i in df.index:
    print(df.iloc[i].to_dict())

{'Name': 'Sameer', 'Class': 11, 'Age': 17}
{'Name': 'Leona', 'Class': 11, 'Age': 17}
{'Name': 'Samuel', 'Class': 12, 'Age': 18}
{'Name': 'Jackson', 'Class': 12, 'Age': 17}
{'Name': 'Gray', 'Class': 11, 'Age': 21}
{'Name': 'Sylphia', 'Class': 12, 'Age': 23}

### 9. Samantha has a dataset of top 50 songs from spotify named 'top50spotify.csv'. Import the dataset as a DataFrame and drop the first column and save it as 'top50.csv'

In [78]:
df = pd.read_csv('top50.csv', index_col=0)
df.head()

,Track.Name,Artist.Name,Genre,Beats.Per.Minute,Energy,Danceability,Loudness..dB..,Liveness,Valence.,Length.,Acousticness..,Speechiness.,Popularity
1,Se�orita,Shawn Mendes,canadian pop,117,55,76,-6,8,75,191,4,3,79
2,China,Anuel AA,reggaeton flow,105,81,79,-4,8,61,302,8,9,92
3,boyfriend (with Social House),Ariana Grande,dance pop,190,80,40,-4,16,70,186,12,46,85
4,Beautiful People (feat. Khalid),Ed Sheeran,pop,93,65,64,-8,8,55,198,12,19,86
5,Goodbyes (Feat. Young Thug),Post Malone,dfw rap,150,65,58,-4,11,18,175,45,7,94

In [80]:
df.drop(columns=['Track.Name']).to_csv('top50.csv')

### 10. Find the average Energy and Length of first 10 songs

In [84]:
first_10_songs = df.head(10)
first_10_songs[['Energy','Length.']].agg(['mean'])

      Energy  Length.
mean    65.1    195.6